In [1]:
import pandas as pd

In [3]:
#pd.__version__

In [4]:
list_1=[11,12,13]
dic_1={"Name":["a","b"],"age":[12,13]}

In [7]:
#list_1

In [8]:
#dic_1

#### Series

In [11]:
series_1=pd.Series(list_1,index=["one","two","three"])

In [29]:
#series_1

In [30]:
#type(list(series_1.values))

In [31]:
#dic_1

In [32]:
#df=pd.DataFrame(dic_1)

In [20]:
df

  Name  age
0    a   12
1    b   13

In [33]:
#type(df)

In [28]:
#type(df.values)

In [26]:
#df.shape

In [27]:
#len(df)

In [36]:
#df.columns.tolist()

# ### reading file using pandas

In [39]:
india_pop=pd.read_excel(r"C:\Users\mail2\OneDrive\Desktop\ML-2022\Ml_Data\Population_Summary.xlsx")

In [41]:
#india_pop

In [42]:
india_pop.shape

(35, 9)

In [44]:
#india_pop.describe()

In [49]:
#india_pop.head(5)
#india_pop.sample(5)

In [51]:
india_pop.columns

Index(['Rank', 'State_UT', 'Population', 'Rulal', 'Urban', 'Share', 'Growth',
       'Country', 'World_Rank'],
      dtype='object')

In [59]:
Population_1=india_pop[["Population","State_UT"]]
#Population_1=india_pop.Population

In [62]:
#type(Population_1)
india_pop.head(1)

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
0,1,Uttar Pradesh,199812341,77.73,22.27,16.5,20.23,Brazil,5

In [68]:
india_pop.loc[:10,"State_UT":"Rulal"]

          State_UT  Population  Rulal
0    Uttar Pradesh   199812341  77.73
1      Maharashtra   112374333  54.78
2            Bihar   104099452  88.71
3      West Bengal    91276115  68.13
4   Andhra Pradesh    84580777  66.64
5   Madhya Pradesh    72626809  72.37
6       Tamil Nadu    72147030  51.60
7        Rajasthan    68548437  75.13
8        Karnataka    61095297  61.33
9          Gujarat    60439692  57.40
10          Odisha    41974218  83.31